<template>
    <div class="content">
        <H1 style="font-size: 48px; margin-left: 30px">博文标题</H1>
        <div style="margin-left: 30px">
            <img class="headpic" src="../../assets/headPic.jpg">
            <div class="author">冷jing灬</div>
            <div class="time">2020-02-03 16:10:02</div>
            <div style="clear: both"></div>
        </div>
        <div class="tag-group">
            <el-tag
                    v-for="item in items"
                    :key="item.label"
                    :type="item.type"
                    effect="plain">
                {{ item.label }}
            </el-tag>
        </div>
        <div class="blogcontent">
            在一次家庭饭局上，我父亲提到：现在科技真发达，连人工智能都出来了，可以识别你的人脸，可以算计你的消费能力，甚至下棋的时候，还能下赢人类中的顶级高手！对此他老人家有个疑问：这些人工智能怎么这么聪明，难道自己就会了？

            我顿时愣了一下，是啊，如果机器学习会思考，那么是如何思考的呢？

            就拿人工智能中应用最广的机器学习来说，在整个学习流程中，其实并不是自己就会了。如果大致分为两类的话，可以分为监督学习和无监督学习，监督学习的过程就像我们教咿呀学语的小孩认识爸爸和妈妈一样，我们给这两个人贴上标签，分别是“爸爸””和“妈妈”，又或者像是在教数学题一样，土豆2元钱一斤，5斤是多少钱？这些预先指定数据的意义的学习的方式就是监督学习；而无监督学习则是通过自身的规则，来划分数据之间的差别或识别特性的方式，也就是所谓自己就会了。

            但是并不是机器学习都这么靠自己就学会了，其中涉及一些步骤——数据预处理、建立模型、验证模型以及优化模型。其实和我们人类学习的流程大致相同，只不过在某些方法上显得更为精进。数据预处理是为让数据变得可以被接收，可以被解读学习；而模型呢，则像是人形成的主观经验，当然，主观经验并不一定准确，所以需要验证模型；而优化模型则是使自己更加精进。

            我们在这里用机器学习的观点解读一下人类中的存在的现象。

            ▊ 人为什么会对某些类型的信息比较敏感？

            小明爸爸是厨师，或许小明对味觉本身就比较敏感；小虎的妈妈是摄影师，或许小虎对颜色比较敏感。如果一个模型通常在某一种类型的数据中浸淫，那么是否会对该类型的数据敏感呢？笔者认为还是有一定相关性的。至少在机器学习模型中，有这样的情况发生。在人生阅历不足的情况下，机器学习会采用什么方法呢？如下图所示，分别是过采样和欠采样。过采样是把小种类复制多份，以增加其小种类的样本数量。欠采样是从大众类中剔除一些样本，或者说只从大众类中选取部分样本。刻意减少或者增加某一方面的数据，以让数据整体分布平衡。
            ————————————————
            版权声明：本文为CSDN博主「博文视点」的原创文章，遵循 CC 4.0 BY-SA 版权协议，转载请附上原文出处链接及本声明。
            原文链接：https://blog.csdn.net/broadview2006/article/details/104210787
            现在，解决学生会退会的问题，是非常非常重要的。 所以， 本人也是经过了深思熟虑，在每个日日夜夜思考这个问题。
            这样看来， 那么， 培根曾经说过，深窥自己的心，而后发觉一切的奇迹在你自己。这启发了我， 总结的来说， 这样看来，
            生活中，若学生会退会出现了，我们就不得不考虑它出现了的事实。 可是，即使是这样，学生会退会的出现仍然代表了一定的意义。
            一般来说， 卡莱尔曾经说过，过去一切时代的精华尽在书中。这不禁令我深思。 学生会退会的发生，到底需要如何做到，不学生会退会的发生，又
            会如何产生。 黑塞在不经意间这样说过，有勇气承担命运这才是英雄好汉。我希望诸位也能好好地体会这句话。 对我个人而言，学生会退会不仅仅是一个重
            大的事件，还可能会改变我的人生。 我们都知道，只要有意义，那么就必须慎重考虑。 那么， 了解清楚学生会退会到底是一种怎么样的存在，是解决一切问题的关
            键。 问题的关键究竟为何？ 我认为， 杰纳勒尔·乔治·S·巴顿在不经意间这样说过，接受挑战，就可以享受胜利的喜悦。这似乎解答了我的疑惑。 吕凯特在不经意间这样说过，生
            命不可能有两次，但许多人连一次也不善于度过。带着这句话，我们还要更加慎重的审视这个问题： 一般来说， 学生会退会，到底应该如何实现。 那么， 总结的来说， 现在，解决学生会退会的问
            题，是非常非常重要的。 所以， 学生会退会因何而发生？ 一般来讲，我们都必须务必慎重的考虑考虑。 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。 黑格尔说过一句富有哲理的话，只有

            永远躺在泥坑里的人，才不会再掉进坑里。这似乎解答了我的疑惑。 那么， 我们不得不面对一个非常尴尬的事实，那就是， 所谓学生会退会，关键是学生会退会需要如何写。 学生会退会，发生了会如何，不发生又会如何。 对
            我个人而言，学生会退会不仅仅是一个重大的事件，还可能会改变我的人生。 学生会退会的发生，到底需要如何做到，不学生会退会的发生，又会如何产生。 一般来讲，我们都必须务必慎重的考虑考虑。 我们一般认为，抓住了问题的关键
            ，其他一切则会迎刃而解。 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。 学生会退会的发生，到底需要如何做到，不学生会退会的发生，又会如何产生。 一般来讲，我们都必须务必慎重的考虑考虑。 要想清楚，
            学生会退会，到底是一种怎么样的存在。 就我个人来说，学生会退会对我的意义，不能不说非常重大。 既然如何， 一般来讲，我们都必须务必慎重的考虑考虑。 现在，解决学生会退会的问题，是非常非常重要的。 所以， 希腊说过一句富有哲理
            的话，最困难的事情就是认识自己。这启发了我， 本人也是经过了深思熟虑，在每个日日夜夜思考这个问题。 可是，即使是这样，学生会退会的出现仍然代表了一定的意义。 了解清楚学生会退会到底是一种怎么样的存在，是解决一切问题的关键。
            本人也是经过了深思熟虑，在每个日日夜夜思考这个问题。 而这些并不是完全重要，更加重要的问题是， 每个人都不得不面对这些问题。 在面对这种问题时， 带着这些问题，我们来审视一下学生会退会。 我们不得不面对一个非常尴尬的事实，

            那就是， 总结的来说， 既然如何， 这种事实对本人来说意义重大，相信对这个世界也是有一定意义的。 既然如何， 西班牙在不经意间这样说过，自己的鞋子，自己知道紧在哪里。这不禁令我深思。 歌德曾经说过，意志坚强的人能把世界放
            在手中像泥块一样任意揉捏。我希望诸位也能好好地体会这句话。
        </div>

    </div>
</template>

<script>
    export default {
        name: "blogContent",
        data() {
            return {
                items: [
                    { type: '', label: '标签一' },
                    { type: 'success', label: '标签二' },
                    { type: 'info', label: '标签三' },
                    { type: 'danger', label: '标签四' },
                    { type: 'warning', label: '标签五' }
                ]
            }
        }
    }
</script>

<style scoped>
    H1{
        margin-top: 20px;
    }
    .tag-group{
        margin-left: 30px;
        margin-top: 15px;
        margin-bottom: 15px;
    }
    .headpic{
        width: 24px;
        height: 24px;
        float: left;
        border: #333333 1px solid;
        border-radius: 999px;
    }
    .time, .author{
        float: left;
        line-height: 24px;
        margin-left: 10px;
    }
    .content{
        width: 100%;
        min-height: 480px;
        background: white;
        text-align: left;
        box-shadow: 6px 6px 6px 0 rgba(0, 0, 0, 0.1);
        border: #D3DCE6 1px solid;
    }

    .blogcontent{
        margin-top: 25px;
        margin-left: 25px;
        margin-right: 15px;
        font-size: 14px;
        margin-bottom: 25px;
        text-align: left;
    }
</style>
